// 地支六合
export const LiuHe = {
    "子": "丑",
    "丑": "子",
    "寅": "亥",
    "卯": "戌",
    "辰": "酉",
    "巳": "申",
    "午": "未",
    "未": "午",
    "申": "巳",
    "酉": "辰",
    "戌": "卯",
    "亥": "寅"
}
// 地支六冲
export const LiuChong = {
    "子": "午",
    "丑": "未",
    "寅": "申",
    "卯": "酉",
    "辰": "戌",
    "巳": "亥",
    "午": "子",
    "未": "丑",
    "申": "寅",
    "酉": "卯",
    "戌": "辰",
    "亥": "巳"
}
// 地支顺序
export const DiZhiIndex = {
    1: "子",
    2: "丑",
    3: "寅",
    4: "卯",
    5: "辰",
    6: "巳",
    7: "午",
    8: "未",
    9: "申",
    10: "酉",
    11: "戌",
    12: "亥"
}

