// 地支五行
export const WuXing = {
    "子": "水",
    "丑": "土",
    "寅": "木",
    "卯": "木",
    "辰": "土",
    "巳": "火",
    "午": "火",
    "未": "土",
    "申": "金",
    "酉": "金",
    "戌": "土",
    "亥": "水",
    "甲": "木",
    "乙": "木",
    "丙": "火",
    "丁": "火",
    "戊": "土",
    "己": "土",
    "庚": "金",
    "辛": "金",
    "壬": "水",
    "癸": "水"
}
// 五行关系
export const Relation = {
    //水
    "水木": "生",
    "水火": "克",
    "水土": "贼",
    "水金": "养",
    "水水": "比",
    //木
    "木水": "养",
    "木火": "生",
    "木土": "克",
    "木金": "贼",
    "木木": "比",
    //火
    "火水": "贼",
    "火火": "比",
    "火土": "生",
    "火金": "克",
    "火木": "养",
    //土
    "土水": "克",
    "土火": "养",
    "土土": "比",
    "土金": "生",
    "土木": "贼",
    //金
    "金水": "生",
    "金火": "贼",
    "金土": "养",
    "金金": "比",
    "金木": "克",
}
// 六亲
export const LiuQin = {
    "生": "子孙",
    "克": "妻财",
    "贼": "官鬼",
    "养": "父母",
    "比": "兄弟"
}