// 地支五行
export const DiZhiWuXing = {
    "子": "水",
    "丑": "土",
    "寅": "木",
    "卯": "木",
    "辰": "土",
    "巳": "火",
    "午": "火",
    "未": "土",
    "申": "金",
    "酉": "金",
    "戌": "土",
    "亥": "水"
}
// 五行关系
export const Relation = {
    //水
    "水木": "生",
    "水火": "克",
    "水土": "被克",
    "水金": "被生",
    "水水": "比",
    //木
    "木水": "被生",
    "木火": "生",
    "木土": "克",
    "木金": "被克",
    "木木": "比",
    //火
    "火水": "被克",
    "火火": "比",
    "火土": "生",
    "火金": "克",
    "火木": "被生",
    //土
    "土水": "克",
    "土火": "被生",
    "土土": "比",
    "土金": "生",
    "土木": "被克",
    //金
    "金水": "生",
    "金火": "被克",
    "金土": "被生",
    "金金": "比",
    "金木": "克",
}
// 六亲
export const LiuQin = {
    "生": "子孙",
    "克": "妻财",
    "被克": "官鬼",
    "被生": "父母",
    "比": "兄弟"
}